app/Http/Controllers/Merchant/MerchantsController.php

select * from `gym_settings` limit 1
---
    public function index() {
        if ($this->data['userCheck']) {
            if (Auth::guard('merchant')->user()->is_admin != 1) {
                return Redirect::route('gym-admin.dashboard.index');
            } else {
                return Redirect::route('gym-admin.superadmin.dashboard');
            }
        }
        $this->data['gymSettings'] = GymSetting::first();