app/Http/Controllers/GymAdmin/AdminGymClientsController.php

select * from `gym_clients` inner join `business_customers` on `business_customers`.`customer_id` = `gym_clients`.`id` where `business_customers`.`detail_id` = '1' and `gym_clients`.`id` = '1' and `gym_clients`.`deleted_at` is null limit 1
select `gym_memberships`.`id` as `id`, `categories`.`name`, `gym_memberships`.`title`, `gym_memberships`.`price`, `gym_memberships`.`status` from `gym_memberships` left join `business_categories` on `business_categories`.`id` = `gym_memberships`.`business_category_id` left join `categories` on `categories`.`id` = `business_categories`.`category_id` where `gym_memberships`.`id` in ('4') and `gym_memberships`.`deleted_at` is null
---
    public function show($id) {
        if (!$this->data['user']->can("edit_customers")) {
            return App::abort(401);
        }

        $client = GymClient::join('business_customers', 'business_customers.customer_id', '=', 'gym_clients.id')
            ->where('business_customers.detail_id', $this->data['user']->detail_id)
            ->find($id);
        $this->data['client'] = $client;
        $this->data['age'] = (!is_null($client->dob))? $client->dob->diff(Carbon::now())->format('%y'):'-';
        $this->data['title'] = "Clients Update";
        $purchases = GymPurchase::where('client_id', '=', $id)->where('detail_id', '=', $this->data['user']->detail_id)->get();
        $memberships = [];
        $start_dates = [];

        foreach ($purchases as $purchase) {
            if ($purchase->membership_id != null) {
                array_push($memberships, $purchase->membership_id);
                array_push($start_dates, $purchase->start_date->toFormattedDateString());
            }
        }

        $this->data['memberships'] = GymMembership::select('gym_memberships.id as id', 'categories.name', 'gym_memberships.title', 'gym_memberships.price', 'gym_memberships.status')
            ->leftJoin('business_categories', 'business_categories.id', '=', 'gym_memberships.business_category_id')
            ->leftJoin('categories', 'categories.id', '=', 'business_categories.category_id')
            ->whereIn('gym_memberships.id', $memberships)
            ->get()->toArray();

select * from `gym_clients` where `gym_clients`.`id` = '1' and `gym_clients`.`deleted_at` is null limit 1
update `gym_clients` set `image` = '1-74913.jpg', `updated_at` = '2020-09-05 05:03:58' where `id` = '1'
---
        }


        $gym_client = GymClient::find($id);
        $gym_client->image = $fileName;
        $gym_client->save();